
"----------
" バンドル
"----------
filetype off
set rtp+=~/.vim/bundle/vundle
call vundle#rc()

"１画面で編集と実行" 
Bundle 'thinca/vim-quickrun'       
"単語を調べる
Bundle 'thinca/vim-ref'            
"補完"
Bundle 'Shougo/neocomplcache.git'
"バンドルをバンドルで管理する"
Bundle 'gmarik/vundle'             

filetype plugin indent on


"--------------
"カラースキーマ
"--------------
set background=dark
colorscheme desert


"-----------------
"エンコーディング
"-----------------
set encoding=utf-8             "Vimの内部エンコーディング
set fileencoding=utf-8         "ファイルに保存するときのエンコーディング
set fileencodings=ucs-bom,iso-2022-jp-3,iso-2022-jp,eucjp-ms,euc-jisx0213,euc-jp,sjis,cp932,utf-8       "読み込み時に使うエンコーディング


"-----------------
"行番号の表示
"-----------------

set number


"--------------
" 色づけをオン
"--------------
syntax on


"--------------------------------------
" タイプ途中のコマンドを画面右下に表示
"--------------------------------------
set showcmd


"---------------------------------------------------------------------
" 検索語を強調表示（光らせる）（<C-L>を押すと現在の強調表示を解除する）
"---------------------------------------------------------------------
set hlsearch


"--------------------------------------------------------------------
" 検索時に大文字・小文字を区別しない。ただし、検索後に大文字小文字が
" 混在しているときは区別する
"--------------------------------------------------------------------
set ignorecase
set smartcase


"----------------------------------------------------------------
" 画面最下行にルーラー（右下に表示される行・列の番号）を表示する
"----------------------------------------------------------------
set ruler


"-------------------------------------------------------------------
" エディタウィンドウの末尾から2行目にステータスラインを常時表示する
"-------------------------------------------------------------------
set laststatus=2


"---------------------------------
"挿入モードにならずに改行を入れる
"---------------------------------
noremap <CR> o<ESC>


"-----------------------------------------------------------
"バックスペースでインデントや改行(eol)を削除できるようにする
"-----------------------------------------------------------
set backspace=indent,eol,start


"-----------------------------------------------------------
"コピペのときに、コメント行が続かないようにする
"-----------------------------------------------------------
"set paste


"--------------------------------
"全角スペースをアンダーバーで表示
"--------------------------------
highlight ZenkakuSpace cterm=underline ctermfg=lightred guibg=darkgray
match ZenkakuSpace /　/


"-----------------------------------------------------------------------
"ヤンクでクリップボードにコピーする(別ウィンドウのvimでもコピペできる)
"-----------------------------------------------------------------------
set clipboard=unnamed,autoselect


